Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectSelector.GetSelectedObjects Method
 Get the analysis objects selected in model views.
 Namespace: Tekla.Structures.Analysis.UI
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetSelectedObjects(
	string analysisModelName
)
Public Function GetSelectedObjects (
	analysisModelName As String
) As AnalysisObjectEnumerator
Parameters
analysisModelName
Type: System.String
The analysis model name.
Return Value
Type: AnalysisObjectEnumerator
The analysis object enumerator of analysis objects selected in model views.
See Also
Reference
AnalysisObjectSelector Class
Tekla.Structures.Analysis.UI Namespace